Revit 2027 API
Metal.MetalPattern Property
 The property labeled "Relief Pattern" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetalPattern { get; }
Public Shared ReadOnly Property MetalPattern As String
	Get
public:
static property String^ MetalPattern {
	String^ get ();
}
static member MetalPattern : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalPatternType".
See Also
Reference
Metal Class
Autodesk.Revit.DB.Visual Namespace